cases/flatPlate/kOmega/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
7800
(
(0.0030666667 7.506113e-05 0.005)
(0.0092 7.506113e-05 0.005)
(0.015333333 7.506113e-05 0.005)
(0.021466667 7.506113e-05 0.005)
(0.0276 7.506113e-05 0.005)
(0.033733333 7.506113e-05 0.005)
(0.039866667 7.506113e-05 0.005)
(0.046 7.506113e-05 0.005)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
52
(
(0 7.506113e-05 0.005)
(0 0.00023268787 0.005)
(0 0.00040607387 0.005)
(0 0.0005967947 0.005)
(0 0.00080658347 0.005)
(0 0.0010373466 0.005)
(0 0.001291181 0.005)
(0 0.0015703933 0.005)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
52
(
(0.92 7.506113e-05 0.005)
(0.92 0.00023268787 0.005)
(0.92 0.00040607387 0.005)
(0.92 0.0005967947 0.005)
(0.92 0.00080658347 0.005)
(0.92 0.0010373466 0.005)
(0.92 0.001291181 0.005)
(0.92 0.0015703933 0.005)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
150
(
(0.0030666667 0 0.005)
(0.0092 0 0.005)
(0.015333333 0 0.005)
(0.021466667 0 0.005)
(0.0276 0 0.005)
(0.033733333 0 0.005)
(0.039866667 0 0.005)
(0.046 0 0.005)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
150
(
(0.0030666667 0.211564 0.005)
(0.0092 0.211564 0.005)
(0.015333333 0.211564 0.005)
(0.021466667 0.211564 0.005)
(0.0276 0.211564 0.005)
(0.033733333 0.211564 0.005)
(0.039866667 0.211564 0.005)
(0.046 0.211564 0.005)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
